https://teachablemachine.withgoogle.com/train/image

In [1]:
name = "cobee"
name

'cobee'

In [2]:
number = 4
number

4

# Machine Learning

There are 7 steps in machine learning:
- Collecting Data
- Preparing Data
- Choosing Model
- Training Model
- Evaluating Model
- Parameter Tuning
- Making Prediction

In [3]:
import pandas as pd

data = [1, 2, 3]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3

In [4]:
student = [['Tom', 90], ['Jack', 80], ['Jill', 70]]
data_student = pd.DataFrame(student, columns=['Name', 'Grade'])
data_student

   Name  Grade
0   Tom     90
1  Jack     80
2  Jill     70

In [5]:
data_student['Name']

0     Tom
1    Jack
2    Jill
Name: Name, dtype: object

In [6]:
new_student = [['Sam', 60], ['Mary', 50], ['John', 40], ['Joseph', 30]]
new_student = pd.DataFrame(new_student, columns=['Name', 'Grade'])

data_student = pd.concat([data_student, new_student], ignore_index=True)
data_student

     Name  Grade
0     Tom     90
1    Jack     80
2    Jill     70
3     Sam     60
4    Mary     50
5    John     40
6  Joseph     30

In [7]:
data_student.head(3)

   Name  Grade
0   Tom     90
1  Jack     80
2  Jill     70

In [8]:
data_student.tail(3)

     Name  Grade
4    Mary     50
5    John     40
6  Joseph     30

In [9]:
data_student.to_csv('data_student.csv')

In [10]:
person = [['Jhony', 'Swimming', 'male'], ['Catherine', 'Drawing', 'female'], ['Jack', 'Gaming', 'male']]
data_person = pd.DataFrame(student, columns=['Name', 'Hobby', 'Gender'])
data_person

ValueError: 3 columns passed, passed data had 2 columns